# CopyWatchAlert Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyMonitorFailures..::..CopyWatchAlert Property
BuiltInFailures..::..CopyMonitorFailures Class See Also
---
Coordination Monitor alert : [Description]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CopyWatchAlert { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CopyWatchAlert As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CopyWatchAlert {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyMonitorFailures Class
Autodesk.Revit.DB Namespace